app/views/tests/_test.html.erb

SELECT COUNT(*) FROM "questions" WHERE "questions"."test_id" = ?  [["test_id", 1]]
---
  <td><%= test.author&.full_name %></td>
  <td align="center"><%= test.questions.count %></td>